In [1]:
import pandas as pd

In [2]:
df=pd.DataFrame({'name':['Anurag','Arun','Ansh','Nikhil','Gautum','Ram'], 'rollno':[2,4,3,1,10,45],'class':['bba','mba','bba','btech','bca','mca']})
df

     name  rollno  class
0  Anurag       2    bba
1    Arun       4    mba
2    Ansh       3    bba
3  Nikhil       1  btech
4  Gautum      10    bca
5     Ram      45    mca

In [8]:
# df.insert(loc=2,column='marks', value=[45,22,19,32,47,39])

In [9]:
df

     name  rollno  marks  class
0  Anurag       2     45    bba
1    Arun       4     22    mba
2    Ansh       3     19    bba
3  Nikhil       1     32  btech
4  Gautum      10     47    bca
5     Ram      45     39    mca

In [6]:
# df.insert(loc=2,column='marks', value=[45,22,19,32,47,39], allow_duplicates=True)

In [14]:
# df.rename(columns={'class':'degree','marks':'totalmarks'})
df.rename(columns={'class':'degree'}, inplace=True)

In [15]:
df

     name  rollno  marks degree
0  Anurag       2     45    bba
1    Arun       4     22    mba
2    Ansh       3     19    bba
3  Nikhil       1     32  btech
4  Gautum      10     47    bca
5     Ram      45     39    mca

In [16]:
df1= pd.DataFrame([[2,3,4,5],[5,6,7,8],[11,12,45,67],[2,3,4,5],[55,32,10,1]])
df1

    0   1   2   3
0   2   3   4   5
1   5   6   7   8
2  11  12  45  67
3   2   3   4   5
4  55  32  10   1

In [20]:
df1[df1.duplicated()]

   0  1  2  3
3  2  3  4  5

In [21]:
df1.drop_duplicates()

    0   1   2   3
0   2   3   4   5
1   5   6   7   8
2  11  12  45  67
4  55  32  10   1

In [22]:
df1.drop_duplicates(inplace=True)

In [23]:
df1

    0   1   2   3
0   2   3   4   5
1   5   6   7   8
2  11  12  45  67
4  55  32  10   1

In [24]:
df

     name  rollno  marks degree
0  Anurag       2     45    bba
1    Arun       4     22    mba
2    Ansh       3     19    bba
3  Nikhil       1     32  btech
4  Gautum      10     47    bca
5     Ram      45     39    mca

In [27]:
import numpy as np

In [28]:
df2= pd.DataFrame({'name':['Anurag','Arun','Ansh','Nikhil','Gautum','Ram'], 'rollno':[2,4,3,None,10,45],'class':['bba',np.nan,'bba','btech','bca',np.nan]})

In [29]:
df2

     name  rollno  class
0  Anurag     2.0    bba
1    Arun     4.0    NaN
2    Ansh     3.0    bba
3  Nikhil     NaN  btech
4  Gautum    10.0    bca
5     Ram    45.0    NaN

In [30]:
df2.isnull()

    name  rollno  class
0  False   False  False
1  False   False   True
2  False   False  False
3  False    True  False
4  False   False  False
5  False   False   True

In [32]:
df2.isnull().any()

name      False
rollno     True
class      True
dtype: bool

In [33]:
df2.isnull().sum()

name      0
rollno    1
class     2
dtype: int64

In [35]:
df2.rollno.fillna(12)

0     2.0
1     4.0
2     3.0
3    12.0
4    10.0
5    45.0
Name: rollno, dtype: float64

In [38]:
df2[df2['class'].isnull()]

   name  rollno class
1  Arun     4.0   NaN
5   Ram    45.0   NaN

In [41]:
null_index = df2[df2['class'].isnull()].index

In [42]:
null_index

Index([1, 5], dtype='int64')

In [43]:
df2.loc[null_index,'class']=['bca','mba']
df2

     name  rollno  class
0  Anurag     2.0    bba
1    Arun     4.0    bca
2    Ansh     3.0    bba
3  Nikhil     NaN  btech
4  Gautum    10.0    bca
5     Ram    45.0    mba

In [44]:
df2.isnull().any()

name      False
rollno     True
class     False
dtype: bool

In [46]:
df2.columns

Index(['name', 'rollno', 'class'], dtype='object')

In [48]:
df2.shape # rows, columns

(6, 3)

In [49]:
df2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    6 non-null      object
 1   rollno  5 non-null      float64
 2   class   6 non-null      object
dtypes: float64(1), object(2)
memory usage: 276.0+ bytes

In [50]:
# fill 
df.marks.mean()

34.0

In [51]:
#file read --

In [52]:
df3= pd.read_csv('AI_Impact_on_Jobs_2030.csv')

In [54]:
df3.head()

,Job_Title,Average_Salary,Years_Experience,Education_Level,AI_Exposure_Index,Tech_Growth_Factor,Automation_Probability_2030,Risk_Category,Skill_1,Skill_2,Skill_3,Skill_4,Skill_5,Skill_6,Skill_7,Skill_8,Skill_9,Skill_10
0,Security Guard,45795,28,Master's,0.18,1.28,0.85,High,0.45,0.10,0.46,0.33,0.14,0.65,0.06,0.72,0.94,0.00
1,Research Scientist,133355,20,PhD,0.62,1.11,0.05,Low,0.02,0.52,0.40,0.05,0.97,0.23,0.09,0.62,0.38,0.98
2,Construction Worker,146216,2,High School,0.86,1.18,0.81,High,0.01,0.94,0.56,0.39,0.02,0.23,0.24,0.68,0.61,0.83
3,Software Engineer,136530,13,PhD,0.39,0.68,0.60,Medium,0.43,0.21,0.57,0.03,0.84,0.45,0.40,0.93,0.73,0.33
4,Financial Analyst,70397,22,High School,0.52,1.46,0.64,Medium,0.75,0.54,0.59,0.97,0.61,0.28,0.30,0.17,0.02,0.42

In [55]:
df3.columns

Index(['Job_Title', 'Average_Salary', 'Years_Experience', 'Education_Level',
       'AI_Exposure_Index', 'Tech_Growth_Factor',
       'Automation_Probability_2030', 'Risk_Category', 'Skill_1', 'Skill_2',
       'Skill_3', 'Skill_4', 'Skill_5', 'Skill_6', 'Skill_7', 'Skill_8',
       'Skill_9', 'Skill_10'],
      dtype='object')

In [56]:
df3.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3000 entries, 0 to 2999
Data columns (total 18 columns):
 #   Column                       Non-Null Count  Dtype
---  ------                       --------------  -----
 0   Job_Title                    3000 non-null   object
 1   Average_Salary               3000 non-null   int64
 2   Years_Experience             3000 non-null   int64
 3   Education_Level              3000 non-null   object
 4   AI_Exposure_Index            3000 non-null   float64
 5   Tech_Growth_Factor           3000 non-null   float64
 6   Automation_Probability_2030  3000 non-null   float64
 7   Risk_Category                3000 non-null   object
 8   Skill_1                      3000 non-null   float64
 9   Skill_2                      3000 non-null   float64
 10  Skill_3                      3000 non-null   float64
 11  Skill_4                      3000 non-null   float64
 12  Skill_5                      3000 non-null   float64
 13  Skill_6                      3000 non-null   float64
 14  Skill_7                      3000 non-null   float64
 15  Skill_8                      3000 non-null   float64
 16  Skill_9                      3000 non-null   float64
 17  Skill_10                     3000 non-null   float64
dtypes: float64(13), int64(2), object(3)
memory usage: 422.0+ KB